@extends('layouts.app')

@section('content')

<div class="container">
    <h1>Про Кафедру</h1>
    <hr>
    <p>Кафедра прикладної математики була створена у 1972 році. </p>

    <p>Розвиток науково-технічного процесу і засобів обчислювальної техніки, теорія алгоритмів, методів програмування,
        чисельних методів математики вимагав зосередження зусиль для утворення самостійного підрозділу інституту, який
        би вирішував проблеми вдосконалення навчального процесу при підготовці фахівців для нафтової ї газової
        промисловості з використанням ЕОМ в інженерних розрахунках. </p>

    <p>Завідувачем кафедри за конкурсом, було обрано доцента Крикуна З.М., який очолював кафедру до 1983 р. До складу
        кафедри увійшли ст. викладачі Кукурудз С.Ф. та Ібрагімов Б.А., асистенти Николайчук Я.М. та Ширмовський Г.Я.,
        інженер кафедри Петрів I.I. На базі кафедри було створено обчислювальний центр, який виділився в окрему
        структурну одиницю інституту. </p>

    <p>З 1983 р. по 1993 р. очолював кафедру доцент Кукурудз С.Ф. Під його керівництвом колектив здійснював роботу щодо
        зміцнення матеріальної бази, повністю оновив методичне забезпечення кафедри. Було підготовлено один підручник
        (проф. Крикун З.М.). 4 навчальних посібники (проф. Юрчишин В.М., доц. Кукурудз С.Ф.). З 1993 р. по 2018 р.
        кафедру очолював професор Юрчишин В.М. Сьогодні кафедру очолює професор Шекета Василь Іванович, на кафедрі
        працює 15 викладачів та 4 співробітників. </p>

    <p>У вересні 2001 року кафедра прикладної математики ліцензувала спеціальність “Програмне забезпечення
        автоматизованих систем” з освітньо-професійних напрямків “Комп’ютерні науки” </p>

    <p>В 2003 році у зв’язку з реорганізацією структури університету кафедра прикладної математики була розділена на дві
        нових кафедри: кафедру програмного забезпечення автоматизованих систем, яку очолив проф. д.т.н. Юрчишин
        Володимир Миколайович та кафедру інформатики, завідувачем якої був обраний проф. д.т.н. Тимків Дмитро
        Федорович. </p>

    <p>З 2003 року, після проходження акредитації, кафедрі було надано право готувати бакалаврів та спеціалістів з
        програмного забезпечення автоматизованих систем. Згідно з рішенням Державної акредитаційної комісії від 22
        червня 2006 року протокол № 61 було акредитовано 50 місць денної та 20 місць заочної форми навчання із
        спеціальності 7.080403 “Програмне забезпечення автоматизованих систем” </p>

    <p>В 2006 році кафедра програмного забезпечення автоматизованих систем здійснила перший випуск спеціалістів
        освітньо-кваліфікаційного напряму “Комп’ютерні науки”. </p>

    <p>В 2007 році одержано державну ліцензію на підготовку магістрів зі спеціальності “Програмне забезпечення
        автоматизованих систем” </p>

    <p>2008 рік став ювілейним роком співпраці кафедри програмного забезпечення автоматизованих систем з інститутом
        післядипломної освіти, що функціонує в складі університету та здійснює перепідготовку фахівців з напряму
        “Комп’ютерні науки”. В цьому році одержав диплом спеціаліста про другу вищу освіту 100-й випускник з присвоєнням
        кваліфікації – інженер-програміст. </p>

    <p>В 2008 році був здійснений перший випуск магістрів спеціальності “Програмне забезпечення автоматизованих
        систем”. </p>

    <p>В 2018 році кафедру ПЗАС було перейменовано на кафедру іженерії програмного забезпечення. </p>
</div>
@endsection
